'''
//Напишите программу, которая находит
полное число метров по заданному числу
сантиметров.
'''

a = int(input())
print(a//100)
# Вывод:
# 1050
# 10